app/controllers/comments_controller.rb

    def create
        comment = Comment.new
        comment.content = params[:input_content]
        comment.note_id = params[:note_id]
        comment.save
---
INSERT INTO "comments" ("content", "note_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["content", "asssaas"], ["note_id", 1], ["created_at", "2018-07-24 06:32:45.707361"], ["updated_at", "2018-07-24 06:32:45.707361"]]