app/controllers/notes_controller.rb

INSERT INTO "notes" ("title", "content", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "aer"], ["content", "gssfggf"], ["user_id", 1], ["created_at", "2018-07-24 05:49:18.974279"], ["updated_at", "2018-07-24 05:49:18.974279"]]
---
    def create
        n = Note.new
        n.title = params[:input_title]
        n.content = params[:input_content]
        n.user = current_user
        n.save

SELECT "notes".* FROM "notes"
---
    def study
        @notes = Note.all

SELECT  "notes".* FROM "notes" WHERE "notes"."id" = ? LIMIT 1  [["id", 1]]
---
    def show
        @note = Note.find(params[:id])

SELECT  "notes".* FROM "notes" WHERE "notes"."id" = ? LIMIT 1  [["id", 1]]
---
    def edit
        @note = Note.find(params[:id])